In [2]:
%load_ext sql

In [3]:
%sql sqlite:///chinook.db

In [4]:
%%sql
SELECT * FROM invoices 
LIMIT 5

 * sqlite:///chinook.db
Done.

[(1, 2, '2009-01-01 00:00:00', 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', 1.98),
 (2, 4, '2009-01-02 00:00:00', 'Ullevålsveien 14', 'Oslo', None, 'Norway', '0171', 3.96),
 (3, 8, '2009-01-03 00:00:00', 'Grétrystraat 63', 'Brussels', None, 'Belgium', '1000', 5.94),
 (4, 14, '2009-01-06 00:00:00', '8210 111 ST NW', 'Edmonton', 'AB', 'Canada', 'T6G 2C7', 8.91),
 (5, 23, '2009-01-11 00:00:00', '69 Salem Street', 'Boston', 'MA', 'USA', '2113', 13.86)]

### GROUP BY

In [ ]:
%%sql
SELECT BillingCountry, COUNT(BillingCountry) AS Count FROM invoices
GROUP BY BillingCountry
ORDER BY COUNT(BillingCountry) DESC

### BETWEEN

In [8]:
%%sql
SELECT BillingAddress, Total FROM invoices
WHERE
Total BETWEEN 10 AND 15
ORDER BY Total DESC
LIMIT 10

 * sqlite:///chinook.db
Done.

[('Berger Straße 10', 14.91),
 ('69 Salem Street', 13.86),
 ('Theodor-Heuss-Straße 34', 13.86),
 ('8, Rue Hanovre', 13.86),
 ('1 Infinite Loop', 13.86),
 ('Calle Lira, 198', 13.86),
 ('Tauentzienstraße 8', 13.86),
 ('700 W Pender Street', 13.86),
 ('113 Lupus St', 13.86),
 ('696 Osborne Street', 13.86)]